org/2015-02-09-funcion-exponencial.org
#+title: La función exponencial
#+author: 
#+date: 2015-02-09 9:00

#+setupfile: opciones.org

#+beamer: \setbeamertemplate{navigation symbols}{}
#+beamer: \setbeamertemplate{items}[circle]
#+beamer: \languagepath{spanish}

#+latex_header: \usepackage{tikz}
#+latex_header: \usepackage{tikz-cd}
#+latex_header: \usepackage{pgfplots}
#+latex_header: \usetikzlibrary{babel}

#+beamer: \tableofcontents

* Definición

** 

*** 
    Observemos que las funciones \(u=e^{x}\cos y\) y \(v=e^{x}\sin y\)
    satisfacen las ecuaciones de Cauchy-Riemann en el plano complejo
    \(\mathbb{C}\). 

*** 							       :B_definition:
    :PROPERTIES:
    :BEAMER_env: definition
    :END:
    La función de variable compleja
    \begin{displaymath}
    f(z)=f(x+iy)=e^{x}\cos y+ie^{x}\sin y
    \end{displaymath}
    se llama *función exponencial compleja*.

** Propiedades

   - \((e^{z})'=e^{z}\).
   - \(e^{a+b}=e^{a}e^{b}\) para todos \(a,b\in \mathbb{C}\).
   - \(e^{z}\ne 0\) para todo \(z\in \mathbb{C}\).
   - \(f(z)=e^{z}\) es una función *entera*, es decir, es analítica en
     \(\mathbb{C}\). 

* Las funciones trigonométricas

** 

*** 							       :B_definition:
    :PROPERTIES:
    :BEAMER_env: definition
    :END:
    Las funciones trigonométricas de variable compleja se definen
    como:
    \begin{displaymath}
    \cos z=\frac{e^{iz}+e^{-iz}}{2},\qquad \sin z=\frac{e^{iz}-e^{-iz}}{2i}
    \end{displaymath}

*** Propiedades
    - \(e^{iz}=\cos z+i\sin z\) (fórmula de Euler),
    - \(\cos^{2} z+\sin^{2}z=1\),
    - \((\cos z)'=-\sin z\), \((\sin z)'=\cos z\),
    - \(\cos(a+b)=\cos a\cos b-\sin a\sin b\), \(\sin(a+b)=\cos a\sin
      b+\sin a\cos b\).
